console.log(a);
var a = 10;
/* Завдяки тому, як працює Hoisting, наша змінна піднімається до гори та ініціалізується,
але присвоєння до неї не спрацьовує, тому в консолі виведеться undefined */

myFunction();

function myFunction() {
  console.log('Hello, world!');
}
/* Завдяки тому що ми використовуємо у цьому прикладі function declaration, та тому як працює Hoisting,
наша функція піднімається до гори та ініціалізується, тому ми можему її викликати до того як вона була фактично оголошена */

console.log(b);
let b = 5;
